-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2016-04-15 15:26:09
-- 服务器版本： 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `worker`
--

-- --------------------------------------------------------

--
-- 表的结构 `department`
--

CREATE TABLE IF NOT EXISTS `department` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci AUTO_INCREMENT=7 ;

--
-- 转存表中的数据 `department`
--

INSERT INTO `department` (`id`, `name`) VALUES
(3, '综合管理部'),
(4, '财务营运部'),
(5, '晋江支行'),
(6, '南安支行');

-- --------------------------------------------------------

--
-- 表的结构 `exam`
--

CREATE TABLE IF NOT EXISTS `exam` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `project` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci AUTO_INCREMENT=13 ;

--
-- 转存表中的数据 `exam`
--

INSERT INTO `exam` (`id`, `project`) VALUES
(3, '考勤'),
(9, '服务质量'),
(10, '日常管理工作'),
(11, '个人业绩'),
(12, '推动业绩');

-- --------------------------------------------------------

--
-- 表的结构 `exam_content`
--

CREATE TABLE IF NOT EXISTS `exam_content` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `project` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `content` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `grade` tinyint(1) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `projiect` (`project`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci AUTO_INCREMENT=65 ;

--
-- 转存表中的数据 `exam_content`
--

INSERT INTO `exam_content` (`id`, `project`, `content`, `grade`) VALUES
(4, '考勤', '日常考勤', 100),
(47, '服务质量', '品行作风', 10),
(48, '服务质量', '沟通能力', 10),
(49, '服务质量', '服务态度', 10),
(50, '服务质量', '执行能力', 10),
(51, '服务质量', '办事效率', 10),
(52, '服务质量', '配合支持', 10),
(53, '服务质量', '指导能力', 10),
(54, '服务质量', '创新能力', 10),
(55, '服务质量', '服务质量', 10),
(56, '服务质量', '进取意识', 10),
(57, '日常管理工作', '品行作风', 20),
(58, '日常管理工作', '执行能力', 20),
(59, '日常管理工作', '办事效率', 20),
(60, '日常管理工作', '团队协作', 20),
(61, '日常管理工作', '进取意识', 20),
(62, '个人业绩', '储蓄', 50),
(63, '个人业绩', '对公', 30),
(64, '个人业绩', '个贷', 20);

-- --------------------------------------------------------

--
-- 表的结构 `exam_data`
--

CREATE TABLE IF NOT EXISTS `exam_data` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `project` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `examer` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `member` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `time` varchar(8) COLLATE utf8mb4_unicode_ci NOT NULL,
  `content` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `grade` varchar(3) COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci AUTO_INCREMENT=435 ;

--
-- 转存表中的数据 `exam_data`
--

INSERT INTO `exam_data` (`id`, `project`, `examer`, `member`, `time`, `content`, `grade`) VALUES
(83, '服务质量', 'admin', '张三', '2016-04', '品行作风', '0.1'),
(84, '服务质量', 'admin', '张三', '2016-04', '沟通能力', '0.1'),
(85, '服务质量', 'admin', '张三', '2016-04', '服务态度', '0.1'),
(86, '服务质量', 'admin', '张三', '2016-04', '服务质量', '0.1'),
(87, '服务质量', 'admin', '张三', '2016-04', '执行能力', '0.1'),
(88, '服务质量', 'admin', '张三', '2016-04', '办事效率', '0.1'),
(89, '服务质量', 'admin', '张三', '2016-04', '配合支持', '0.0'),
(90, '服务质量', 'admin', '张三', '2016-04', '指导能力', '0.0'),
(91, '服务质量', 'admin', '张三', '2016-04', '创新能力', '0.0'),
(92, '服务质量', 'admin', '张三', '2016-04', '进取意识', '0.0'),
(93, '服务质量', 'admin', '张三', '2016-04', '', '0'),
(94, '服务质量', 'admin', '张三', '2016-04', '', '0'),
(95, '服务质量', 'admin', '张三', '2016-04', '品行作风', '0.1'),
(96, '服务质量', 'admin', '张三', '2016-04', '沟通能力', '0.1'),
(97, '服务质量', 'admin', '张三', '2016-04', '服务态度', '0.1'),
(98, '服务质量', 'admin', '张三', '2016-04', '服务质量', '0.1'),
(99, '服务质量', 'admin', '张三', '2016-04', '执行能力', '0.1'),
(100, '服务质量', 'admin', '张三', '2016-04', '办事效率', '0.1'),
(101, '服务质量', 'admin', '张三', '2016-04', '配合支持', '0.0'),
(102, '服务质量', 'admin', '张三', '2016-04', '指导能力', '0.0'),
(103, '服务质量', 'admin', '张三', '2016-04', '创新能力', '0.0'),
(104, '服务质量', 'admin', '张三', '2016-04', '进取意识', '0.0'),
(105, '服务质量', 'admin', '张三', '2016-04', '', '0'),
(106, '服务质量', 'admin', '张三', '2016-04', '', '0'),
(107, '服务质量', 'admin', '张三', '2016-04', '品行作风', '0.4'),
(108, '服务质量', 'admin', '张三', '2016-04', '沟通能力', '0.4'),
(109, '服务质量', 'admin', '张三', '2016-04', '服务态度', '0.4'),
(110, '服务质量', 'admin', '张三', '2016-04', '执行能力', '0.4'),
(111, '服务质量', 'admin', '张三', '2016-04', '办事效率', '0.4'),
(112, '服务质量', 'admin', '张三', '2016-04', '配合支持', '0.4'),
(113, '服务质量', 'admin', '张三', '2016-04', '指导能力', '0.4'),
(114, '服务质量', 'admin', '张三', '2016-04', '创新能力', '0.4'),
(115, '服务质量', 'admin', '张三', '2016-04', '服务质量', '0.4'),
(116, '服务质量', 'admin', '张三', '2016-04', '进取意识', '0.4'),
(117, '服务质量', 'admin', '张三', '2016-04', '品行作风', '0.4'),
(118, '服务质量', 'admin', '张三', '2016-04', '沟通能力', '0.4'),
(119, '服务质量', 'admin', '张三', '2016-04', '服务态度', '0.4'),
(120, '服务质量', 'admin', '张三', '2016-04', '执行能力', '0.4'),
(121, '服务质量', 'admin', '张三', '2016-04', '办事效率', '0.4'),
(122, '服务质量', 'admin', '张三', '2016-04', '配合支持', '0.4'),
(123, '服务质量', 'admin', '张三', '2016-04', '指导能力', '0.4'),
(124, '服务质量', 'admin', '张三', '2016-04', '创新能力', '0.4'),
(125, '服务质量', 'admin', '张三', '2016-04', '服务质量', '0.4'),
(126, '服务质量', 'admin', '张三', '2016-04', '进取意识', '0.4'),
(127, '服务质量', '7', '张三', '2016-04', '品行作风', '0.2'),
(128, '服务质量', '7', '张三', '2016-04', '沟通能力', '0.2'),
(129, '服务质量', '7', '张三', '2016-04', '服务态度', '0.2'),
(130, '服务质量', '7', '张三', '2016-04', '执行能力', '0.2'),
(131, '服务质量', '7', '张三', '2016-04', '办事效率', '0.2'),
(132, '服务质量', '7', '张三', '2016-04', '配合支持', '0.2'),
(133, '服务质量', '7', '张三', '2016-04', '指导能力', '0.2'),
(134, '服务质量', '7', '张三', '2016-04', '创新能力', '0.2'),
(135, '服务质量', '7', '张三', '2016-04', '服务质量', '0.2'),
(136, '服务质量', '7', '张三', '2016-04', '进取意识', '0.2'),
(137, '服务质量', '7', '张三', '2016-04', '品行作风', '0.2'),
(138, '服务质量', '7', '张三', '2016-04', '沟通能力', '0.2'),
(139, '服务质量', '7', '张三', '2016-04', '服务态度', '0.2'),
(140, '服务质量', '7', '张三', '2016-04', '执行能力', '0.2'),
(141, '服务质量', '7', '张三', '2016-04', '办事效率', '0.2'),
(142, '服务质量', '7', '张三', '2016-04', '配合支持', '0.2'),
(143, '服务质量', '7', '张三', '2016-04', '指导能力', '0.2'),
(144, '服务质量', '7', '张三', '2016-04', '创新能力', '0.2'),
(145, '服务质量', '7', '张三', '2016-04', '服务质量', '0.2'),
(146, '服务质量', '7', '张三', '2016-04', '进取意识', '0.2'),
(147, '日常管理工作', '3', '张三', '2016-04', '品行作风', '8'),
(148, '日常管理工作', '3', '张三', '2016-04', '执行能力', '8'),
(149, '日常管理工作', '3', '张三', '2016-04', '办事效率', '8'),
(150, '日常管理工作', '3', '张三', '2016-04', '团队协作', '8'),
(151, '日常管理工作', '3', '张三', '2016-04', '进取意识', '8'),
(152, '服务质量', '10', '张三', '2016-04', '品行作风', '0.0'),
(153, '服务质量', '10', '张三', '2016-04', '沟通能力', '0.0'),
(154, '服务质量', '10', '张三', '2016-04', '服务态度', '0.0'),
(155, '服务质量', '10', '张三', '2016-04', '执行能力', '0.0'),
(156, '服务质量', '10', '张三', '2016-04', '办事效率', '0.5'),
(157, '服务质量', '10', '张三', '2016-04', '配合支持', '0.5'),
(158, '服务质量', '10', '张三', '2016-04', '指导能力', '0.5'),
(159, '服务质量', '10', '张三', '2016-04', '创新能力', '0.5'),
(160, '服务质量', '10', '张三', '2016-04', '服务质量', '0.5'),
(161, '服务质量', '10', '张三', '2016-04', '进取意识', '0.5'),
(162, '服务质量', '11', '张三', '2016-04', '品行作风', '0.4'),
(163, '服务质量', '11', '张三', '2016-04', '沟通能力', '0.4'),
(164, '服务质量', '11', '张三', '2016-04', '服务态度', '0.4'),
(165, '服务质量', '11', '张三', '2016-04', '执行能力', '0.4'),
(166, '服务质量', '11', '张三', '2016-04', '办事效率', '0.4'),
(167, '服务质量', '11', '张三', '2016-04', '配合支持', '0.4'),
(168, '服务质量', '11', '张三', '2016-04', '指导能力', '0.4'),
(169, '服务质量', '11', '张三', '2016-04', '创新能力', '0.4'),
(170, '服务质量', '11', '张三', '2016-04', '服务质量', '0.4'),
(171, '服务质量', '11', '张三', '2016-04', '进取意识', '0.4'),
(172, '服务质量', '8', '张三', '2016-04', '品行作风', '0.0'),
(173, '服务质量', '8', '张三', '2016-04', '沟通能力', '0.0'),
(174, '服务质量', '8', '张三', '2016-04', '服务态度', '0.0'),
(175, '服务质量', '8', '张三', '2016-04', '执行能力', '0.0'),
(176, '服务质量', '8', '张三', '2016-04', '办事效率', '0.0'),
(177, '服务质量', '8', '张三', '2016-04', '配合支持', '0.0'),
(178, '服务质量', '8', '张三', '2016-04', '指导能力', '0.0'),
(179, '服务质量', '8', '张三', '2016-04', '创新能力', '0.0'),
(180, '服务质量', '8', '张三', '2016-04', '服务质量', '0.0'),
(181, '服务质量', '8', '张三', '2016-04', '进取意识', '0.0'),
(182, '服务质量', '9', '张三', '2016-04', '品行作风', '0.0'),
(183, '服务质量', '9', '张三', '2016-04', '沟通能力', '0.0'),
(184, '服务质量', '9', '张三', '2016-04', '服务态度', '0.0'),
(185, '服务质量', '9', '张三', '2016-04', '执行能力', '0.0'),
(186, '服务质量', '9', '张三', '2016-04', '办事效率', '0.0'),
(187, '服务质量', '9', '张三', '2016-04', '配合支持', '0.0'),
(188, '服务质量', '9', '张三', '2016-04', '指导能力', '0.0'),
(189, '服务质量', '9', '张三', '2016-04', '创新能力', '0.0'),
(190, '服务质量', '9', '张三', '2016-04', '服务质量', '0.0'),
(191, '服务质量', '9', '张三', '2016-04', '进取意识', '0.1'),
(192, '服务质量', 'admin', '李四', '2016-04', '品行作风', '1'),
(193, '服务质量', 'admin', '李四', '2016-04', '沟通能力', '1'),
(194, '服务质量', 'admin', '李四', '2016-04', '服务态度', '1'),
(195, '服务质量', 'admin', '李四', '2016-04', '执行能力', '1'),
(196, '服务质量', 'admin', '李四', '2016-04', '办事效率', '1'),
(197, '服务质量', 'admin', '李四', '2016-04', '配合支持', '1'),
(198, '服务质量', 'admin', '李四', '2016-04', '指导能力', '1'),
(199, '服务质量', 'admin', '李四', '2016-04', '创新能力', '1'),
(200, '服务质量', 'admin', '李四', '2016-04', '服务质量', '1'),
(201, '服务质量', 'admin', '李四', '2016-04', '进取意识', '1'),
(202, '日常管理工作', '3', '李四', '2016-04', '品行作风', '8'),
(203, '日常管理工作', '3', '李四', '2016-04', '执行能力', '8'),
(204, '日常管理工作', '3', '李四', '2016-04', '办事效率', '8'),
(205, '日常管理工作', '3', '李四', '2016-04', '团队协作', '8'),
(206, '日常管理工作', '3', '李四', '2016-04', '进取意识', '8'),
(222, '服务质量', 'admin', '天一', '2016-04', '品行作风', '0.0'),
(223, '服务质量', 'admin', '天一', '2016-04', '沟通能力', '0.0'),
(224, '服务质量', 'admin', '天一', '2016-04', '服务态度', '0.0'),
(225, '服务质量', 'admin', '天一', '2016-04', '执行能力', '0.0'),
(226, '服务质量', 'admin', '天一', '2016-04', '办事效率', '0.0'),
(227, '服务质量', 'admin', '天一', '2016-04', '配合支持', '0.0'),
(228, '服务质量', 'admin', '天一', '2016-04', '指导能力', '0.0'),
(229, '服务质量', 'admin', '天一', '2016-04', '创新能力', '0.0'),
(230, '服务质量', 'admin', '天一', '2016-04', '服务质量', '0.0'),
(231, '服务质量', 'admin', '天一', '2016-04', '进取意识', '0.0'),
(232, '服务质量', '7', '天一', '2016-04', '品行作风', '0.2'),
(233, '服务质量', '7', '天一', '2016-04', '沟通能力', '0.3'),
(234, '服务质量', '7', '天一', '2016-04', '服务态度', '0.4'),
(235, '服务质量', '7', '天一', '2016-04', '执行能力', '0.4'),
(236, '服务质量', '7', '天一', '2016-04', '办事效率', '0.5'),
(237, '服务质量', '7', '天一', '2016-04', '配合支持', '0.3'),
(238, '服务质量', '7', '天一', '2016-04', '指导能力', '0.4'),
(239, '服务质量', '7', '天一', '2016-04', '创新能力', '0.4'),
(240, '服务质量', '7', '天一', '2016-04', '服务质量', '0.2'),
(241, '服务质量', '7', '天一', '2016-04', '进取意识', '0.4'),
(242, '服务质量', '8', '天一', '2016-04', '品行作风', '0.5'),
(243, '服务质量', '8', '天一', '2016-04', '沟通能力', '0.4'),
(244, '服务质量', '8', '天一', '2016-04', '服务态度', '0.4'),
(245, '服务质量', '8', '天一', '2016-04', '执行能力', '0.4'),
(246, '服务质量', '8', '天一', '2016-04', '办事效率', '0.4'),
(247, '服务质量', '8', '天一', '2016-04', '配合支持', '0.4'),
(248, '服务质量', '8', '天一', '2016-04', '指导能力', '0.2'),
(249, '服务质量', '8', '天一', '2016-04', '创新能力', '0.4'),
(250, '服务质量', '8', '天一', '2016-04', '服务质量', '0.5'),
(251, '服务质量', '8', '天一', '2016-04', '进取意识', '0.4'),
(252, '服务质量', '9', '天一', '2016-04', '品行作风', '0.4'),
(253, '服务质量', '9', '天一', '2016-04', '沟通能力', '0.4'),
(254, '服务质量', '9', '天一', '2016-04', '服务态度', '0.4'),
(255, '服务质量', '9', '天一', '2016-04', '执行能力', '0.4'),
(256, '服务质量', '9', '天一', '2016-04', '办事效率', '0.4'),
(257, '服务质量', '9', '天一', '2016-04', '配合支持', '0.2'),
(258, '服务质量', '9', '天一', '2016-04', '指导能力', '0.3'),
(259, '服务质量', '9', '天一', '2016-04', '创新能力', '0.3'),
(260, '服务质量', '9', '天一', '2016-04', '服务质量', '0.3'),
(261, '服务质量', '9', '天一', '2016-04', '进取意识', '0.4'),
(262, '服务质量', '10', '天一', '2016-04', '品行作风', '0.2'),
(263, '服务质量', '10', '天一', '2016-04', '沟通能力', '0.2'),
(264, '服务质量', '10', '天一', '2016-04', '服务态度', '0.2'),
(265, '服务质量', '10', '天一', '2016-04', '执行能力', '0.2'),
(266, '服务质量', '10', '天一', '2016-04', '办事效率', '0.2'),
(267, '服务质量', '10', '天一', '2016-04', '配合支持', '0.2'),
(268, '服务质量', '10', '天一', '2016-04', '指导能力', '0.2'),
(269, '服务质量', '10', '天一', '2016-04', '创新能力', '0.2'),
(270, '服务质量', '10', '天一', '2016-04', '服务质量', '0.2'),
(271, '服务质量', '10', '天一', '2016-04', '进取意识', '0.2'),
(272, '服务质量', '11', '天一', '2016-04', '品行作风', '0.0'),
(273, '服务质量', '11', '天一', '2016-04', '沟通能力', '0.0'),
(274, '服务质量', '11', '天一', '2016-04', '服务态度', '0.0'),
(275, '服务质量', '11', '天一', '2016-04', '执行能力', '0.0'),
(276, '服务质量', '11', '天一', '2016-04', '办事效率', '0.0'),
(277, '服务质量', '11', '天一', '2016-04', '配合支持', '0.0'),
(278, '服务质量', '11', '天一', '2016-04', '指导能力', '0.0'),
(279, '服务质量', '11', '天一', '2016-04', '创新能力', '0.0'),
(280, '服务质量', '11', '天一', '2016-04', '服务质量', '0.0'),
(281, '服务质量', '11', '天一', '2016-04', '进取意识', '0.0'),
(282, '日常管理工作', '3', '天一', '2016-04', '品行作风', '8'),
(283, '日常管理工作', '3', '天一', '2016-04', '执行能力', '8'),
(284, '日常管理工作', '3', '天一', '2016-04', '办事效率', '8'),
(285, '日常管理工作', '3', '天一', '2016-04', '团队协作', '8'),
(286, '日常管理工作', '3', '天一', '2016-04', '进取意识', '8'),
(287, '服务质量', 'admin', '3', '2016-04', '品行作风', '1.8'),
(288, '服务质量', 'admin', '3', '2016-04', '沟通能力', '1.8'),
(289, '服务质量', 'admin', '3', '2016-04', '服务态度', '1.8'),
(290, '服务质量', 'admin', '3', '2016-04', '执行能力', '1.8'),
(291, '服务质量', 'admin', '3', '2016-04', '办事效率', '1.8'),
(292, '服务质量', 'admin', '3', '2016-04', '配合支持', '1.8'),
(293, '服务质量', 'admin', '3', '2016-04', '指导能力', '1.8'),
(294, '服务质量', 'admin', '3', '2016-04', '创新能力', '1.8'),
(295, '服务质量', 'admin', '3', '2016-04', '服务质量', '1.8'),
(296, '服务质量', 'admin', '3', '2016-04', '进取意识', '1.8'),
(297, '日常管理工作', '3', '3', '2016-04', '品行作风', '0'),
(298, '日常管理工作', '3', '3', '2016-04', '执行能力', '0'),
(299, '日常管理工作', '3', '3', '2016-04', '办事效率', '0'),
(300, '日常管理工作', '3', '3', '2016-04', '团队协作', '0'),
(301, '日常管理工作', '3', '3', '2016-04', '进取意识', '0'),
(351, '日常管理工作', '3', '3', '2016-04', '品行作风', '9.6'),
(352, '日常管理工作', '3', '3', '2016-04', '执行能力', '9.6'),
(353, '日常管理工作', '3', '3', '2016-04', '办事效率', '9.6'),
(354, '日常管理工作', '3', '3', '2016-04', '团队协作', '9.6'),
(355, '日常管理工作', '3', '3', '2016-04', '进取意识', '9.6'),
(356, '日常管理工作', 'admin', '0111', '2016-04', '品行作风', '4.5'),
(357, '日常管理工作', 'admin', '0111', '2016-04', '执行能力', '4.5'),
(358, '日常管理工作', 'admin', '0111', '2016-04', '办事效率', '4.5'),
(359, '日常管理工作', 'admin', '0111', '2016-04', '团队协作', '4.5'),
(360, '日常管理工作', 'admin', '0111', '2016-04', '进取意识', '4.5'),
(361, '考勤', 'admin', '0111', '2016-04', '日常考勤', '4'),
(362, '考勤', 'admin', '222', '2016-04', '日常考勤', '4'),
(363, '日常管理工作', 'admin', '222', '2016-04', '品行作风', '5'),
(364, '日常管理工作', 'admin', '222', '2016-04', '执行能力', '6'),
(365, '日常管理工作', 'admin', '222', '2016-04', '办事效率', '6'),
(366, '日常管理工作', 'admin', '222', '2016-04', '团队协作', '6'),
(367, '日常管理工作', 'admin', '222', '2016-04', '进取意识', '6'),
(368, '日常管理工作', 'admin', '333', '2016-04', '品行作风', '9.6'),
(369, '日常管理工作', 'admin', '333', '2016-04', '执行能力', '9.6'),
(370, '日常管理工作', 'admin', '333', '2016-04', '办事效率', '9.6'),
(371, '日常管理工作', 'admin', '333', '2016-04', '团队协作', '9.6'),
(372, '日常管理工作', 'admin', '333', '2016-04', '进取意识', '9.6'),
(373, '考勤', 'admin', '55', '2016-04', '日常考勤', '2.5'),
(374, '服务质量', '66', '66', '2016-04', '品行作风', '2.5'),
(375, '服务质量', '66', '66', '2016-04', '沟通能力', '2.5'),
(376, '服务质量', '66', '66', '2016-04', '服务态度', '2.5'),
(377, '服务质量', '66', '66', '2016-04', '执行能力', '2.5'),
(378, '服务质量', '66', '66', '2016-04', '办事效率', '2.5'),
(379, '服务质量', '66', '66', '2016-04', '配合支持', '2.5'),
(380, '服务质量', '66', '66', '2016-04', '指导能力', '2.5'),
(381, '服务质量', '66', '66', '2016-04', '创新能力', '2.5'),
(382, '服务质量', '66', '66', '2016-04', '服务质量', '2.5'),
(383, '服务质量', '66', '66', '2016-04', '进取意识', '2.5'),
(384, '考勤', 'admin', '66', '2016-04', '日常考勤', '2.5'),
(385, '日常管理工作', 'admin', '55', '2016-04', '品行作风', '5'),
(386, '日常管理工作', 'admin', '55', '2016-04', '执行能力', '5'),
(387, '日常管理工作', 'admin', '55', '2016-04', '办事效率', '5'),
(388, '日常管理工作', 'admin', '55', '2016-04', '团队协作', '5'),
(389, '日常管理工作', 'admin', '55', '2016-04', '进取意识', '5'),
(395, '日常管理工作', 'admin', '77', '2016-04', '品行作风', '3.5'),
(396, '日常管理工作', 'admin', '77', '2016-04', '执行能力', '4'),
(397, '日常管理工作', 'admin', '77', '2016-04', '办事效率', '3'),
(398, '日常管理工作', 'admin', '77', '2016-04', '团队协作', '3'),
(399, '日常管理工作', 'admin', '77', '2016-04', '进取意识', '3'),
(410, '日常管理工作', '10', '333', '2016-04', '品行作风', '0'),
(411, '日常管理工作', '10', '333', '2016-04', '执行能力', '0'),
(412, '日常管理工作', '10', '333', '2016-04', '办事效率', '0'),
(413, '日常管理工作', '10', '333', '2016-04', '团队协作', '0'),
(414, '日常管理工作', '10', '333', '2016-04', '进取意识', '0'),
(415, '服务质量', '10', '333', '2016-04', '品行作风', '1.6'),
(416, '服务质量', '10', '333', '2016-04', '沟通能力', '1.4'),
(417, '服务质量', '10', '333', '2016-04', '服务态度', '1.4'),
(418, '服务质量', '10', '333', '2016-04', '执行能力', '1.4'),
(419, '服务质量', '10', '333', '2016-04', '办事效率', '1.4'),
(420, '服务质量', '10', '333', '2016-04', '配合支持', '1.4'),
(421, '服务质量', '10', '333', '2016-04', '指导能力', '1.4'),
(422, '服务质量', '10', '333', '2016-04', '创新能力', '1.4'),
(423, '服务质量', '10', '333', '2016-04', '服务质量', '1.4'),
(424, '服务质量', '10', '333', '2016-04', '进取意识', '1.4'),
(425, '日常管理工作', 'admin', '999', '2016-04', '品行作风', '3.5'),
(426, '日常管理工作', 'admin', '999', '2016-04', '执行能力', '8.5'),
(427, '日常管理工作', 'admin', '999', '2016-04', '办事效率', '8.5'),
(428, '日常管理工作', 'admin', '999', '2016-04', '团队协作', '8.5'),
(429, '日常管理工作', 'admin', '999', '2016-04', '进取意识', '8.5'),
(430, '日常管理工作', '999', '999', '2016-04', '品行作风', '8.5'),
(431, '日常管理工作', '999', '999', '2016-04', '执行能力', '8.5'),
(432, '日常管理工作', '999', '999', '2016-04', '办事效率', '10'),
(433, '日常管理工作', '999', '999', '2016-04', '团队协作', '8'),
(434, '日常管理工作', '999', '999', '2016-04', '进取意识', '8');

-- --------------------------------------------------------

--
-- 表的结构 `grades`
--

CREATE TABLE IF NOT EXISTS `grades` (
  `id` int(1) NOT NULL AUTO_INCREMENT,
  `time` varchar(8) COLLATE utf8mb4_unicode_ci NOT NULL,
  `member` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `department` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `grade` varchar(5) COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci AUTO_INCREMENT=29 ;

--
-- 转存表中的数据 `grades`
--

INSERT INTO `grades` (`id`, `time`, `member`, `department`, `grade`) VALUES
(17, '2016-04', '张三', '综合管理部', '40'),
(18, '2016-04', '李四', '综合管理部', '50'),
(20, '2016-04', '天一', '财务营运部', '53'),
(23, '2016-04', '3', '综合管理部', '66'),
(24, '2016-04', '66', '综合管理部', '27'),
(26, '2016-04', '333', '综合管理部', '62.2'),
(27, '2016-04', '999', '综合管理部', '80.5'),
(28, '2016-04', 'admin', '', '0.0');

-- --------------------------------------------------------

--
-- 表的结构 `member`
--

CREATE TABLE IF NOT EXISTS `member` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `account` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `department` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `office` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `sort` tinyint(1) NOT NULL,
  `examer_time` varchar(160) COLLATE utf8mb4_unicode_ci NOT NULL,
  `exam` varchar(130) COLLATE utf8mb4_unicode_ci NOT NULL,
  `exam_weight` varchar(120) COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `account` (`account`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci AUTO_INCREMENT=50 ;

--
-- 转存表中的数据 `member`
--

INSERT INTO `member` (`id`, `account`, `password`, `name`, `department`, `office`, `sort`, `examer_time`, `exam`, `exam_weight`) VALUES
(1, 'admin', 'admin', 'admin', '', '管理员', 0, '#', '', ''),
(20, '7', '111', '7', '晋江支行', '副行长', 2, '#', '#', '#'),
(21, '8', '111', '8', '晋江支行', '副行长', 2, '#', '#', '#'),
(22, '9', '111', '9', '南安支行', '副行长', 2, '#', '#', '#'),
(23, '10', '111', '10', '南安支行', '行长', 1, '#', '#', '#'),
(24, '11', '111', '11', '', '行长', 1, '#', '#', '#'),
(31, '2850', '111', '张三', '综合管理部', '员工', 4, '#3>2016-04#admin>2016-04#10>2016-04#11>2016-04#7>2016-04#8>2016-04#9>2016-04#', '#日常管理工作#服务质量#服务质量#服务质量#服务质量#服务质量#服务质量#', '#0.8#0.05#0.05#0.05#0.03#0.01#0.01#'),
(32, '2777', '111', '李四', '综合管理部', '员工', 4, '#3>2016-04#admin>2016-04#', '#日常管理工作#服务质量#', '#0.8#0.2#'),
(34, '0', '111', '天一', '财务营运部', '员工', 4, '#3>2016-04#7>2016-04#8>2016-04#9>2016-04#10>2016-04#11>2016-04#admin>2016-04#', '#日常管理工作#服务质量#服务质量#服务质量#服务质量#服务质量#服务质量#', '#0.8#0.05#0.05#0.05#0.03#0.01#0.01#'),
(35, '3', '111', '3', '综合管理部', '领导', 3, '#3>2016-04#admin>2016-04#', '#日常管理工作#服务质量#', '#0.8#0.2#'),
(38, '0111', '111', '0111', '综合管理部', '员工', 4, '#0111>#admin>2016-04#', '#服务质量#考勤#', '#0.2#0.8#'),
(39, '222', '111', '222', '综合管理部', '员工', 4, '#222>#admin>2016-04#', '#服务质量#日常管理工作#', '#0.5#0.5#'),
(40, '333', '111', '333', '综合管理部', '员工', 4, '#admin>2016-04#10>2016-04#', '#日常管理工作#服务质量#', '#0.8#0.2#'),
(41, '55', '111', '55', '综合管理部', '员工', 4, '#55>#admin>2016-04#', '#服务质量#日常管理工作#', '#0.5#0.5#'),
(42, '66', '111', '66', '综合管理部', '员工', 4, '#66>2016-04#admin>2016-04#', '#服务质量#考勤#', '#0.5#0.5#'),
(45, '77', '111', '77', '综合管理部', '员工', 4, '#77>#admin>2016-04#', '#服务质量#日常管理工作#', '#0.5#0.5#'),
(47, '999', '111', '999', '综合管理部', '员工', 4, '#999>2016-04#admin>2016-04#', '#日常管理工作#日常管理工作#', '#0.5#0.5#'),
(48, '1', '111', '1', '综合管理部', '员工', 4, '#admin>#10>#', '#日常管理工作#考勤#', '#0.8#0.2#'),
(49, '2', '111', '2', '财务营运部', '员工', 4, '#admin>#10>#', '#服务质量#考勤#', '#0.8#0.2#');

-- --------------------------------------------------------

--
-- 表的结构 `office`
--

CREATE TABLE IF NOT EXISTS `office` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `level` varchar(8) COLLATE utf8mb4_unicode_ci NOT NULL,
  `sort` tinyint(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci AUTO_INCREMENT=7 ;

--
-- 转存表中的数据 `office`
--

INSERT INTO `office` (`id`, `level`, `sort`) VALUES
(2, '行长', 1),
(3, '副行长', 2),
(5, '领导', 3),
(6, '员工', 4);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
